#+TITLE: A Python interactive guide on Org-babel
#+Date: [2020-12-18 ven.]
#+Author: Philippe Estival
#+email: [[mailto:phil.estival@free.fr]]

* The interpreter

Python is distributed with every Linux system.
Many =bash= and =perl= programs, parts of the operating system,
have been rewritten with it.

: (setq python-shell-interpreter "python3")

Now you can check your python system interpreter
#+name:python.sys.version
#+begin_src python :results value 
  import sys
  return sys.version
#+end_src

#+RESULTS: python.sys.version
: 3.9.1 (default, Jan 11 2021, 16:54:16) 


If the answer is 2.7, you'll have to make one more
customization tweak. The official Python distribution is now
Python 3.  The 2.7 interpreter is still around for
historical reasons, but will be dropped from now on.

: (customize-variable 'org-babel-python-command)

to =python3=, and now we are set.


While for proper shell to start interactively
outside of org-babel, the variable will be

: (customize-variable 'python-shell-interpreter)

type =M-x : run-python=
and the shell (the CPython shell) starts.

If somehow, somewhere the interpreter already started —
typically when a =session= code block gets evaluated, then the
shell is already open in a buffer named =*Python*=.

Notice it tells you =python.el= completion is loaded.  You
should have basic syntax coloring and completion by pressing
=tab=.  =M-n= and =M-p= loops through the history of commands.

Another python interpreter you should be aware of
is =ipython= which provides some extra features :
a =zsh= prompt on the very same command line and
/automodule reloading/, but we'll save that for later.

Python is often said to be an interpreted programming
language, but a language is not "interpreted" or "compiled"
as such. A specific implementation can be an interpreter or
a compiler.  Over simplification, but still: when a program
is run, every line of code feeds, in sequence, the
interpreter/compiler which translates the program into
byte-code.  The last step generates files, landing in the
=__pycache__= a folder which in turn contains =.pyc= files extensions 
named after your program. You can completely ignore that folder,
the interpreter will manage it.


* Passing variables between blocks

#+name: X
#+begin_src python :session :var n=3
  n
#+end_src

#+RESULTS: X
: 3

#+name: golden ratio
#+begin_src python :session :results value :var i=3
  from math import sqrt
  print(n)
  n+=i
  (n+sqrt(5))/2
#+end_src

#+RESULTS: golden ratio
: 4.118033988749895



When babel doesn't provide
the expected output, the error might be silenced,
— which isn't much in the spirit of python —
or displayed in the =*Org-Babel Error Output*= buffer.
In the first block, changing the variable to n="3"
will raise an error in the second block,
wich in turn won't provide any result.
The error appears in the =*Python*= buffer,
but it's not the best place to investigate.
Changing the =:results= from =value= to =output=
will make the situation explicit.

For debugging at least : if the intent is
to use that result to feed another function,
then =output= won't provide the computed golden
ratio, but the =print= statement output, which
is the integer 3 in this example.

Babel provides an extra layer to organize
the code, so in the end it's only a matter
of opening the proper channels to direct
the results in the proper buffers.

* Formatting output, tables of squares and cubes

#+Begin_src python :results output

  print(' {4:2s}    {0:5s} {1:7s}{2:4s}  {3:10s}'.format('x','x^2','ko','x^3','n'))

  for n in range(0, 11):
       x=2<<n
       ko=int(x**2/1024)
       print('{4:2d} {0:5d} {1:7d} {2:4d}{3:12d}'.format(x,x**2,ko,x**3,n))

  print('-'*33)
  # right justify as string (through repr or str)
  for x in range(1, 12):
       print(repr(x).rjust(2), repr(x*x).rjust(3), end=' | ')
       # Note use of 'end' on previous line, instead of '\n' by default
       print(repr(x**3).rjust(4))

#+end_src

#+RESULTS:
#+begin_example
 n     x     x^2    ko    x^3
 0     2       4    0           8
 1     4      16    0          64
 2     8      64    0         512
 3    16     256    0        4096
 4    32    1024    1       32768
 5    64    4096    4      262144
 6   128   16384   16     2097152
 7   256   65536   64    16777216
 8   512  262144  256   134217728
 9  1024 1048576 1024  1073741824
10  2048 4194304 4096  8589934592
---------------------------------
 1   1 |    1
 2   4 |    8
 3   9 |   27
 4  16 |   64
 5  25 |  125
 6  36 |  216
 7  49 |  343
 8  64 |  512
 9  81 |  729
10 100 | 1000
11 121 | 1331
#+end_example

** sys.stdout

#+begin_src python :results output
  import sys
  sys.stdout.write("1..")
  sys.stdout.write("2")
  sys.stdout.flush()

#+end_src

#+RESULTS:
: 1..2
None
None

* Lambda expressions
#+begin_src python :session :results var
def g(n, f=lambda i:0):
   return [f(i) for i in range(1,n+1)]

g(10, f=lambda x:2**x), g(10, f=lambda x:3**x)
#+end_src

#+RESULTS:
| 2 | 4 |  8 | 16 |  32 |  64 |  128 |  256 |   512 |  1024 |
| 3 | 9 | 27 | 81 | 243 | 729 | 2187 | 6561 | 19683 | 59049 |

** Init, Enter, Exit
#+Begin_src python :session :results output
  class aClass :
      def __init__(self,v):
          self.v=v
      def __enter__(self):
          print(__class__, "__enter__", self)
          return self.v
      def __exit__(self, type, value, traceback):
          print(__class__, '__exit__', value, traceback)
      def __del__(self):
          print(__class__, '__del__', self)

  print('>')
  with aClass(42) as value:
      print ("\ninside of block 'with'", value)
#+end_src

#+RESULTS:
: >
: <class '__main__.aClass'> __enter__ <__main__.aClass object at 0x7f9a53e11a20>
:
: inside of bloc 'with' 42
: <class '__main__.aClass'> __exit__ None None
: <class '__main__.aClass'> __del__ <__main__.aClass object at 0x7f9a53e11a20>


Note that =self= isn't a keyword.
The following is still respectable python

#+Begin_src python :session :results output
  class MyClass :
      def __init__(λ,v):
          λ.v=v
      def __enter__(λ):
          print(__class__,"__enter__")
          return λ.v
      def __exit__(λ,type, value, traceback):
          print(__class__,'__exit__',value,traceback)
      def __del__(λ):
          print(__class__,'__del__')

  print('\r')
  with MyClass(42) as value:
      print ("in block 'with' and",value)
#+end_src



The output of the execution order isn't however guaranteed
The output of "ok" and True will follow that order,
but the call to =__del__= may appear before "ok" :
the function gets a copy, yet the object is deleted.
#+name: ClassMethods
#+Begin_src python :results output
  class aClass :
      def __init__(self,v):
          self.v=v
      def __enter__(self):
          print(__class__,"__enter__")
          return self.v
      def __exit__(self,type,value,traceback):
          print(__class__,'__exit__',value,traceback)
      def __del__(self):
          print('__del__')
      def p(self):
          print("ok",self)
          return True

  f = aClass(1).p
  print(f())
#+end_src

#+RESULTS: ClassMethods
: ok <__main__.aClass object at 0x7f3d68298fa0>
: True
: __del__

session output in
#+call: ClassMethods[:session]()
#+RESULTS:
: __del__
: ok <__main__.aClass object at 0x7f75451a4910>
: True

non-session output :
#+call: ClassMethods()
#+RESULTS:
: ok <__main__.aClass object at 0x7f0059834fa0>
: True
: __del__



** Generic Function /single dispatch/
Java-like Polymorphism with decorators
#+name: single_dispatch
#+Begin_src python :results output
  from functools import singledispatch
  @singledispatch
  def F(arg):
      return "default"

  @F.register(int)
  @F.register(float)
  def _(arg):
      return "for a number"

  class C: pass

  @F.register(C)
  def _(arg):
      return "for a an objet C"

  print( ( F("x"), F([]), F(1), F(C()) ) )
  print(F.registry.keys())
#+end_src

#+RESULTS: single_dispatch
: ('default', 'default', 'for a number', 'for a an objet C')
: dict_keys([<class 'object'>, <class 'float'>, <class 'int'>, <class '__main__.C'>])

* org-tables

[[info:org#Environment of a Code Block]]
#+NAME: less-cols
          | a |
          |---|
          | b |
          | c |

 #+begin_src python :var tab=less-cols :colnames yes
 return [[val + '*' for val in row] for row in tab]
 #+end_src

 #+RESULTS:
 | a  |
 |----|
 | b* |
 | c* |
* TODO Serialization with pickle

#+begin_src python :session :results output
  from pickle import dumps, load

  class A:
      def __init__(self,v):
          self.v=v

  F = testfile="/tmp/serialize.dump"

  a = A(15)
  f = open(F,'wb')
  f.write(dumps(a))
  f.close()

  f = open(F,'rb')
  o = load(f)
  f.close()

  print (o.v)
#+end_src

#+RESULTS:
: 15

* strftime reference
Note: Examples are based on datetime.datetime(2013, 9, 30, 7, 6, 5)
| Code | Meaning                                                           |                  Example |
| %a   | Weekday as locale’s abbreviated name.                             |                      Mon |
| %A   | Weekday as locale’s full name.                                    |                   Monday |
| %w   | Weekday as a decimal number, where 0 is Sunday and 6 is Saturday. |                        1 |
| %d   | Day of the month as a zero-padded decimal number.                 |                       30 |
| %-d  | Day of the month as a decimal number. (Platform specific)         |                       30 |
| %b   | Month as locale’s abbreviated name.                               |                      Sep |
| %B   | Month as locale’s full name.                                      |                September |
| %m   | Month as a zero-padded decimal number.                            |                       09 |
| %-m  | Month as a decimal number. (Platform specific)                    |                        9 |
| %y   | Year without century as a zero-padded decimal number.             |                       13 |
| %Y   | Year with century as a decimal number.                            |                     2013 |
| %H   | Hour (24-hour clock) as a zero-padded decimal number.             |                       07 |
| %-H  | Hour (24-hour clock) as a decimal number. (Platform specific)     |                        7 |
| %I   | Hour (12-hour clock) as a zero-padded decimal number.             |                       07 |
| %-I  | Hour (12-hour clock) as a decimal number. (Platform specific)     |                        7 |
| %p   | Locale’s equivalent of either AM or PM.                           |                       AM |
| %M   | Minute as a zero-padded decimal number.                           |                       06 |
| %-M  | Minute as a decimal number. (Platform specific)                   |                        6 |
| %S   | Second as a zero-padded decimal number.                           |                       05 |
| %-S  | Second as a decimal number. (Platform specific)                   |                        5 |
| %f   | Microsecond as a decimal number, zero-padded on the left.         |                   000000 |
| %z   | UTC offset in the form +HHMM or -HHMM                             |                          |
|      | (empty string if the the object is naive).                        |                          |
| %Z   | Time zone name (empty string if the object is naive).             |                          |
| %j   | Day of the year as a zero-padded decimal number.                  |                      273 |
| %-j  | Day of the year as a decimal number. (Platform specific)          |                      273 |
| %U   | Week number of the year (Sunday as the first day of the week)     |                          |
|      | as a zero padded decimal number. All days in a new year preceding |                          |
|      | the first Sunday are considered to be in week 0.                  |                       39 |
| %W   | Week number of the year (Monday as the first day of the week)     |                          |
|      | as a decimal number. All days in a new year preceding the first   |                          |
|      | Monday are considered to be in week 0.                            |                       39 |
| %c   | Locale’s appropriate date and time representation.                | Mon Sep 30 07:06:05 2013 |
| %x   | Locale’s appropriate date representation.                         |                 09/30/13 |
| %X   | Locale’s appropriate time representation.                         |                 07:06:05 |
| %%   | A literal '%' character.                                          |                        % |


#+begin_src python :results output
from time import time
t = time()
print(t)

#+end_src

#+RESULTS:
: 1583875689.1584399

   #+begin_src python
import time

def countdown(t):
    while t:
        mins, secs = divmod(t, 60)
        timeformat = '{:02d}:{:02d}'.format(mins, secs)
        print(timeformat, end='\r')
        time.sleep(1)
        t -= 1
    print('Goodbye!\n\n\n\n\n')
   #+end_src

**** DONE default bindings 
#+NAME: DefaultBindings
#+Begin_src python :session :tangle yes

  def key(event):
      print ("pressed", repr(event.keysym))

  def Esc(event):
      quit()

  def mouseCallback(evt):
      Log.put({'type':evt.type,'widget':evt.widget,'x':evt.x,'y':evt.y, 'btn':evt.num})
      # x and y root left aside

  def callback(evt):
      print (evt.type)

  def ignore(event):
      # avoid this for toplevel as is will mute the event
      return "break"

  def windows_callback(evt):
  # a <configure> event
  #
  # evt 22 = configure (windows_event). peu utile comme évènement, niveau trace/debug
      Log.put(evt.type,{'width':evt.width,'height':evt.height,'x_root':evt.x_root,'y_root':evt.y_root})
  # no ? filter event logging base on their type : better, pipe it to the tkinter filter
  # rem : not very pythonic
  # let's see later about dnd'


  def defaultbindings(frame):
      frame.bind("<Key>",key)
  #   The user pressed any key. The key is provided in the char member of the event object passed to the callback (this is an empty string for special keys).

  #    a
  #   The user typed an “a”. Most printable characters can be used as
  #   is. The exceptions are space (<space>) and less than
  #   (<less>). Note that 1 is a keyboard binding, while <1> is a
  #   button binding.
      frame.bind("<Escape>",Esc)
      frame.bind("<Button-1>", callback)
      frame.bind("<Button-2>", callback)
      # think about the Menu button
      frame.bind("<Button-2>", callback)
      frame.bind("<Double-Button-1>", callback)
      # Note that if you bind to both a single click (<Button-1>)
      # and a double click, both bindings will be called.

      frame.bind("<Enter>", callback)
      # The mouse pointer entered the widget (this event doesn’t mean that
      # the user pressed the Enter key!).

      frame.bind("<Leave>", callback)
      # The mouse pointer left the widget.

      frame.bind("<FocusIn>", callback)
      # Keyboard focus was moved to this widget, or to a child of this widget.
      frame.bind("<FocusOut>", callback)
      # Keyboard focus was moved from this widget to another widget.

      frame.bind("<Return>", callback)

      # The user pressed the Enter key. You can bind to virtually all keys on the keyboard. For an ordinary 102-key PC-style keyboard, the special keys are Cancel (the Break key), BackSpace, Tab, Return(the Enter key), Shift_L (any Shift key), Control_L (any Control key), Alt_L (any Alt key), Pause, Caps_Lock, Escape, Prior (Page Up), Next (Page Down), End, Home, Left, Up, Right, Down, Print, Insert, Delete, F1, F2, F3, F4, F5, F6, F7, F8, F9, F10, F11, F12, Num_Lock, and Scroll_Lock.

      frame.bind("<Shift-Up>", callback)

      # The user pressed the Up arrow, while holding the Shift key
      # pressed. You can use prefixes like Alt, Shift, and Control.

      frame.bind("<Configure>", windows_callback)

      # The widget changed size (or location, on some platforms). The
      # new size is provided in the width and height attributes of the
      # event object passed to the callback.

  "defaults bindings set"

#+end_src
#+RESULTS: DefaultBindings
: defaults bindings set
=defaults bindings set

* Maximum Nesting Depth of the Parentheses
https://yewtu.be/watch?v=zrOIQEN3Wkk
#+begin_src python 
import re,operator
s="(+(2*3)+((8)/4))+1"
def scan(f, state, it): 
     for x in it: state = f(state, x) 
       yield state 
return max(list(scan(operator.add, 0, [(1 if x=="(" else -1) for x in re.findall("[()]",s)])))
#+end_src

#+RESULTS:
: 3
